# Importing Libraries

In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
path = r'C:\Users\ranji\04_22_Instacart_Basket_Analysis'

In [4]:
#Importing data frame
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
#Renaming columns
df.rename(columns = {'Surnam' : 'Family Name'}, inplace = True)

In [7]:
df.rename(columns = {'n_dependants' : 'Children'}, inplace = True)

In [8]:
df.rename(columns = {'fam_status' : 'Status'}, inplace = True)

In [10]:
#Checking data types
df.dtypes

user_id         int64
First Name     object
Family Name    object
Gender         object
STATE          object
Age             int64
date_joined    object
Children        int64
Status         object
income          int64
dtype: object

In [11]:
#Desctriptive Stats
df.describe()

             user_id            Age       Children         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
#Checking for NAs
df.isnull().sum()

user_id            0
First Name     11259
Family Name        0
Gender             0
STATE              0
Age                0
date_joined        0
Children           0
Status             0
income             0
dtype: int64

In [13]:
#Dropping Name columns 
df_customer = df.drop(columns = ['Family Name', 'First Name'])

In [14]:
#Checking for mixed data types
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
   print (col)

In [15]:
#Checking for duplicates
df_customer[df_customer.duplicated()]

Empty DataFrame
Columns: [user_id, Gender, STATE, Age, date_joined, Children, Status, income]
Index: []

In [16]:
#Importing project file
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_4.8.pkl'))

In [17]:
df_ords_prods.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
order_dow                    int64
order_hour                   int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
True                      category
Busiest_day                 object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spent              float64
spending_flag               object
order_frquency             float64
frequency_flag              object
dtype: object

In [18]:
#Merging the two dataframes
df_ords_prods_merged = ords_prods.merge(df_customer, on = 'user_id')

In [19]:
df_ords_prods_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'Task_4.9_1.pkl'))